In [16]:
# coding=utf-8   #默认编码格式为utf-
!type "D:\Jupyter\利用Putf-8ython进行数据分析2\yjx\Python-\chapter6\data\ex1.txt"

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [1]:
import pandas as pd
f = open('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter6\data\ex1.txt')
df = pd.read_csv(f)
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
f = open('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter6\data\ex1.txt')
pd.read_table(f, sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
f1 = open('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter6\data\ex3.csv')
df2 = pd.read_csv(f1,encoding='utf-8')
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
f1 = open('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter6\data\ex1.csv')
df3 = pd.read_csv(f1,encoding='utf-8')
df3

   锘縜   b   c   d message
0   1   2   3   4   hello
1   5   6   7   8   world
2   9  10  11  12     foo

### JSON数据

In [25]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [27]:
import json
result = json.loads(obj)    #json.loads即可将JSON字符串转换成Python形式
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [29]:
asjson = json.dumps(result)

In [30]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [ ]:
#如果你需要将数据从pandas输出到JSON，可以使用to_json方法

### XML和HTML

In [28]:
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
len(tables)

1

In [29]:
failures = tables[0]

In [30]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"

In [32]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2017      8
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

### 二进制数据格式

In [36]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
#实现数据的高效二进制格式存储最简单的办法之一是使用Python内置的pickle序列化

### HDF5

### web API